app/Controllers/Home.php

SELECT *
FROM `employees`
WHERE `employee_id` = 'sa42192'
AND `dob` = '1992-05-27'
AND `approved` = 1
 LIMIT 1
---
    public function index(): string
    {
        $request = service('request');
        $employee = null;
        $error = null;
        $empId = trim($request->getGet('employee_id') ?? '');
        $dob = trim($request->getGet('dob') ?? '');
        if ($empId && $dob) {
            $employeeModel = new \App\Models\EmployeeModel();
            $searchDob = $this->convertToDbDate($dob);
            $employee = $employeeModel->where('employee_id', $empId)
                ->where('dob', $searchDob)
                ->where('approved', 1)
                ->first();